# — CLI / utilities — core dev tooling
brew "git"             # Version control system
brew "zsh"             # Latest Zsh shell (for using Homebrew zsh instead of system)
brew "fzf"             # Fuzzy finder (Ctrl-R, file search, etc.)
brew "fd"              # Fast and user-friendly alternative to `find`
brew "bat"             # A `cat` with syntax highlighting and nicer output
brew "htop"            # Interactive process viewer (better than `top`)
brew "ripgrep"         # Fast recursive grep-like search tool (`rg`)
brew "coreutils"       # GNU coreutils (g* versions, for more Linux-like tools)
brew "curl"            # Latest curl (sometimes newer than system one)
brew "pnpm"            # Fast, disk-efficient package manager for Node.js
brew "mas"             # Download stuff from mac app store
brew "zinit"           # zsh utilities
brew "asdf"            # manage runtime versions


# GUI / casks
cask "visual-studio-code"
cask "ghostty"
cask "firefox"
cask "webstorm"
cask "1password"       # Password manager
cask "obsidian"        # Markdown-based knowledge base app
cask "bettermouse"     # Mouse utility
cask "betterdisplay"   # Display management tool
cask "bettertouchtool" # Input device customization / automation tool  [oai_citation:1‡Homebrew Formulae](https://formulae.brew.sh/cask/bettertouchtool?utm_source=chatgpt.com)


# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"